1.

In [ ]:
name_job_dict = {
   "Josh": "This is John, he is an artist",
   "Ted": "This is Ted, he is an engineer",   
   "Kenedy": "This is Kennedy, he is a teacher",
}

print name_job_dict[name]

2.

In [ ]:
adj = ["red", "big", "tasty"]
fruits = ["apple", "banana", "cherry"]

for x in adj:
    for y in fruits:
        print(x, y)

3.

In [6]:
import pandas as pd
import numpy as np

df = pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv")

df = df.drop(['PID'], axis = 1)

In [7]:
df

   ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0   104.0      PUTNAM            Y            3        1  1000
1   197.0   LEXINGTON            N            3      1.5    --
2     NaN   LEXINGTON            N          NaN        1   850
3   201.0    BERKELEY           12            1      NaN   700
4   203.0    BERKELEY            Y            3        2  1600
5   207.0    BERKELEY            Y          NaN        1   800
6     NaN  WASHINGTON          NaN            2   HURLEY   950
7   213.0     TREMONT            Y            1        1   NaN
8   215.0     TREMONT            Y           na        2  1800

In [8]:
print(df['ST_NUM'])
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [9]:
df['OWN_OCCUPIED'].unique()

array(['Y', 'N', '12', nan], dtype=object)

In [10]:
df['NUM_BEDROOMS'].unique()

array(['3', nan, '1', '2', 'na'], dtype=object)

In [13]:
df['NUM_BATH'].unique()

array(['1', '1.5', nan, '2', 'HURLEY'], dtype=object)

In [14]:
nan_values = ['na', '12', 'HURLEY', '--']

In [15]:
df = pd.read_csv("https://raw.githubusercontent.com/dataoptimal/posts/master/data%20cleaning%20with%20python%20and%20pandas/property%20data.csv"
                , na_values = nan_values)

In [19]:
df = df.drop(['PID'], axis = 1)

In [20]:
print(df.isnull().sum())

ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    3
NUM_BATH        2
SQ_FT           2
dtype: int64

In [21]:
df

   ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0   104.0      PUTNAM            Y           3.0       1.0  1000.0
1   197.0   LEXINGTON            N           3.0       1.5     NaN
2     NaN   LEXINGTON            N           NaN       1.0   850.0
3   201.0    BERKELEY          NaN           1.0       NaN   700.0
4   203.0    BERKELEY            Y           3.0       2.0  1600.0
5   207.0    BERKELEY            Y           NaN       1.0   800.0
6     NaN  WASHINGTON          NaN           2.0       NaN   950.0
7   213.0     TREMONT            Y           1.0       1.0     NaN
8   215.0     TREMONT            Y           NaN       2.0  1800.0